read_verilog -sv -formal -overwrite {workspace}/counter_M/code/counter_rtl.v
design -reset-vlog; proc;
write_json {workspace}/netlist/counter_rtl.json